tap "homebrew/services"
# Next generation open source RPC library and framework
brew "grpc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Next-gen compiler infrastructure
brew "llvm"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Arduino command-line interface
brew "arduino-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU compiler collection
brew "gcc"
# Optimized BLAS library
brew "openblas"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# Cross-platform make
brew "cmake"
# File comparison utilities
brew "diffutils"
# Modern, maintained replacement for ls
brew "eza"
# Accuracy-focused XAudio reimplementation for open platforms
brew "faudio"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Graphics Library
brew "mesa"
# Open-source alternative to the OpenGL Utility Toolkit (GLUT) library
brew "freeglut"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# High performance message passing library
brew "open-mpi"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cross-platform library for audio I/O
brew "portaudio"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Software for mathematics, science, and engineering
brew "scipy"
# Tool Command Language
brew "tcl-tk"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Suite of barcodes-reading tools
brew "zbar"
# Markdown editor
cask "mark-text"
# Interactive JavaScript, Python or SQL interface
cask "mysql-shell"
# Scientific Python IDE
cask "spyder"
# Multiplayer code editor
cask "zed@preview"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "openai.chatgpt"
vscode "redhat.java"
vscode "saoudrizwan.claude-dev"
vscode "svelte.svelte-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
